#!/usr/bin/env python3
# -*- coding: utf-8 -*-

#          - VI -
# დაწერეთ პროგრამა რომელიც text ცლადში არსებულ ტექსტის თითოეულ ჩარაქტერის უნიკოდის ნომერს დააჯამებს და
# შედეგს შეინახავს all_uni ცვლადში.

text = """უნიკოდი წარმოადგენს საერთაშორისო სტანდარტს, 
რომლის მიხედვითაც მთელი მსოფლიო თანხმდება ინფორმაციის გაცვლის გარკვეულ სტანდარტზე. 
უნიკოდის მიხედვით ნებისმიერ ბეჭდვით სიმბოლოს (ჩარაქტერს) შეესაბამება გარკვეული რიცხვი. 
ტექსტური ინფორმაციის გასაგზავნად ან კომპიუტერის მეხსიერებაში შენახვის დროს, 
ხდება მოცემულ ტექსტში არსებული სიმბოლოების შესატყვისი რიცხვების გადაგზავნა ან შენახვა. 
დღეისთვის უნიკოდში შესულია 143924 სიმბოლო. 
პითონს ავტომატურად აქვს უნიკოდის მხარდაჭერა და ნებისმიერი სტრინგში რომელიც გამოცხადებულია b თავსართის გარეშე, 
შესაძლებელია უნიკოდის ნებისმიერი სიმბოლოს გამოყენება. 
სტინგში შეგვიძლია გამოვიყენოთ ქართული ანბანის სიმბოლოები"""
